quyen_bao_cao/old/plan_final_report/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
1. GET Trang Dang Nhap,1000,3631,5,5879,1279.79,0.000%,104.90978,3201.49,13.52,31249.0
POST Dang Nhap,1000,4236,50,4709,569.19,0.000%,72.95542,2226.35,22.23,31249.0
3. POST Nop Code,1000,3691,141,5004,958.97,0.000%,63.30717,1955.91,48.78,31637.0
TOTAL,3000,3853,5,5879,1017.13,0.000%,189.16703,5796.63,75.93,31378.3